In [4]:
from sqlalchemy import create_engine
import pandas as pd

#### Crear el "engine" pasando la direcci√≥n de la db

In [5]:
engine = create_engine('postgresql://postgres:root@localhost:5432/Vinos')
engine

Engine(postgresql://postgres:***@localhost:5432/Vinos)

#### Hacemos un MERGE entre el JSON y CSV

In [27]:
json = pd.read_json('./customer.json')
json['birthday'] = pd.to_datetime(json['birthday'], unit='ns')
json

      addess   birthday gender  idCustomer        name     phone
0  Address 1 2000-10-10      F           1  Customer 1  11111111
1  Address 2 2015-01-12      M           2  Customer 2  22222222
2  Address 3 2014-01-10      F           3  Customer 3  33333333
3  Address 4 2011-01-10      F           4  Customer 3  44444444

In [30]:
csv = pd.read_csv('./customer.csv')
csv['birthday'] = pd.to_datetime(csv['birthday'], unit='ns')
csv

   idCustomer        name     addess     phone   birthday gender
0           1  Customer 1  Address 1  11111111 2000-10-10      F
1           2  Customer 2  Address 2  22222222 2015-01-12      M
2           3  Customer 3  Address 3  33333333 2014-01-10      F
3           4  Customer 3  Address 4  44444444 2011-01-10      F
4           5  Customer 5  Address 4  44444444 2011-01-10      F
5           6  Customer 6  Address 4  44444444 2011-01-10      F

In [31]:
merged = pd.merge(json, csv, how='outer')
merged

      addess   birthday gender  idCustomer        name     phone
0  Address 1 2000-10-10      F           1  Customer 1  11111111
1  Address 2 2015-01-12      M           2  Customer 2  22222222
2  Address 3 2014-01-10      F           3  Customer 3  33333333
3  Address 4 2011-01-10      F           4  Customer 3  44444444
4  Address 4 2011-01-10      F           5  Customer 5  44444444
5  Address 4 2011-01-10      F           6  Customer 6  44444444

#### Hacemos un CONCAT entre el JSON y un DataFrame

In [32]:
data = [['Address 5', '1992-11-29 00:00:00', 'M', '5', 'Bruno', 55555555],
        ['Address 6', '1992-10-14 00:00:00', 'F', '6', 'Natalia', 66666666],
        ['Address 7', '2003-05-01 00:00:00', 'M', '7', 'Alberto', 77777777]]
new_df = pd.DataFrame(data)
new_df.columns = json.columns.values
concatenated = pd.concat([json , new_df])

In [33]:
concatenated

      addess             birthday gender idCustomer        name     phone
0  Address 1  2000-10-10 00:00:00      F          1  Customer 1  11111111
1  Address 2  2015-01-12 00:00:00      M          2  Customer 2  22222222
2  Address 3  2014-01-10 00:00:00      F          3  Customer 3  33333333
3  Address 4  2011-01-10 00:00:00      F          4  Customer 3  44444444
0  Address 5  1992-11-29 00:00:00      M          5       Bruno  55555555
1  Address 6  1992-10-14 00:00:00      F          6     Natalia  66666666
2  Address 7  2003-05-01 00:00:00      M          7     Alberto  77777777

#### Hacemos un APPEND del resultado de una consulta SQL y un DataFrame

In [34]:
df_wine = pd.read_sql_query('select * from "Wine"',con=engine)
df_wine

   WineCode    Type Vintage
0         1  Blanco    2000
1         2   Tinto    2010
2         3  Rosado    2015

In [35]:
new_df = pd.Series([4,'Espumante','2001'], index=df_wine.columns) 
df_wine.append(new_df, ignore_index=True)

   WineCode       Type Vintage
0         1     Blanco    2000
1         2      Tinto    2010
2         3     Rosado    2015
3         4  Espumante    2001

#### Hacemos el JOIN de una consulta SQL y un JSON

In [36]:
sql_customer = pd.read_sql_query('select * from "Customer"',con=engine)
sql_customer

   idCustomer        name     addess     phone   birthday gender
0           1  Customer 1  Address 1  11111111 2000-10-10      F
1           2  Customer 2  Address 2  22222222 2015-01-12      M
2           3  Customer 3  Address 3  33333333 2014-01-10      F
3           4  Customer 3  Address 4  44444444 2011-01-10      F

In [39]:
#abrimos el json
join_json = pd.read_json('./join.json')
join_json

                 email
0  customer1@gmail.com
1  customer2@gmail.com
2  customer3@gmail.com
3  customer4@gmail.com

In [40]:
sql_customer.join(join_json, how='left')

,idCustomer,name,addess,phone,birthday,gender,email
0,1,Customer 1,Address 1,11111111,2000-10-10,F,customer1@gmail.com
1,2,Customer 2,Address 2,22222222,2015-01-12,M,customer2@gmail.com
2,3,Customer 3,Address 3,33333333,2014-01-10,F,customer3@gmail.com
3,4,Customer 3,Address 4,44444444,2011-01-10,F,customer4@gmail.com